In [ ]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder, OrdinalEncoder
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split as tts   
import pylab as plt
import seaborn as sns
import numpy as np
#modelos: regresiones y clasificación
#regresion lineal y regresiones
#lineal
from sklearn.linear_model import LinearRegression as LinReg
from sklearn.linear_model import Lasso        
from sklearn.linear_model import Ridge        
from sklearn.linear_model import ElasticNet   
# support vector regressor
from sklearn.svm import SVR  # support vector regressor
#random forest
from sklearn.ensemble import RandomForestRegressor as RFR  
from sklearn.tree import ExtraTreeRegressor as ETR
#boosting
from sklearn.ensemble import GradientBoostingRegressor as GBR
from xgboost import XGBRegressor as XGBR
from catboost import CatBoostRegressor as CTR
#from lightgbm import LGBMRegressor as LGBMR
#clasificacion
from sklearn.linear_model import LogisticRegression
#clasificacion multi-etiqueta
from sklearn.linear_model import LogisticRegression
import warnings
warnings.filterwarnings('ignore')
from sklearn.metrics import mean_squared_error as mse  # error cuadratico medio

In [5]:
salaries_ = pd.read_csv('../data/salaries_data.csv')

In [6]:
salaries_.shape

(500, 11)

In [7]:
testeo = pd.read_csv('../data/testeo.csv')

In [8]:
testeo.shape

(107, 10)

In [9]:
salaries_X = pd.concat([salaries_, testeo])

In [10]:
salaries_X.reset_index(drop = True, inplace = True)

In [11]:
salaries_X.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [12]:
salaries_X.shape

(607, 11)

In [13]:
#borro las columnas salary y salary_currency porque ya tenemos la y como salary_in_usd en moneda única

In [14]:
salaries_X.drop(['salary', 'salary_currency', 'employee_residence' ], axis = 1, inplace = True)

In [15]:
#salaries_X = salaries.drop('salary_in_usd', axis = 1)

In [16]:
y = salaries_X.salary_in_usd

In [17]:
y.dropna(inplace = True)

In [18]:
salaries_X.job_title.unique()

array(['Data Engineer', 'BI Data Analyst', 'ML Engineer',
       'Machine Learning Scientist', 'Data Scientist', 'Data Analyst',
       'Machine Learning Engineer', 'Principal Data Scientist',
       'Data Engineering Manager', 'Data Analytics Manager',
       'Big Data Engineer', 'Research Scientist',
       'Machine Learning Developer', 'Computer Vision Engineer',
       'AI Scientist', 'Machine Learning Manager', 'Lead Data Scientist',
       'Director of Data Science', '3D Computer Vision Researcher',
       'Data Specialist', 'Applied Data Scientist',
       'Data Science Engineer', 'Head of Data', 'Analytics Engineer',
       'ETL Developer', 'Marketing Data Analyst', 'Data Architect',
       'Data Science Consultant', 'Principal Data Analyst',
       'Head of Data Science', 'Lead Data Engineer',
       'Data Science Manager', 'Applied Machine Learning Scientist',
       'Lead Data Analyst', 'Cloud Data Engineer',
       'Lead Machine Learning Engineer',
       'Machine Learning Infrastructure Engineer', 'Big Data Architect',
       'Product Data Analyst', 'Business Data Analyst',
       'Director of Data Engineering', 'Data Analytics Lead',
       'Financial Data Analyst', 'Finance Data Analyst',
       'Head of Machine Learning', 'Staff Data Scientist',
       'Data Analytics Engineer', 'Computer Vision Software Engineer',
       'Principal Data Engineer', 'NLP Engineer'], dtype=object)

In [19]:
def title(x):
    if 'Machine' in x or 'ML' in x or 'Computer' in x:
        return 'Machine Learning'
    if 'Engineer' in x or 'Engineering' in x:
        return 'Data Engineer'
    if 'Analyst' in x or 'Analytics' in x:
        return 'Data Analyst'
    else:
        return 'Data Scientist'

In [20]:
salaries_X.job_title.value_counts()

Data Scientist                              143
Data Engineer                               132
Data Analyst                                 97
Machine Learning Engineer                    41
Research Scientist                           16
Data Science Manager                         12
Data Architect                               11
Big Data Engineer                             8
Machine Learning Scientist                    8
Director of Data Science                      7
AI Scientist                                  7
Data Analytics Manager                        7
Principal Data Scientist                      7
Data Science Consultant                       7
Computer Vision Engineer                      6
Lead Data Engineer                            6
BI Data Analyst                               6
ML Engineer                                   6
Data Engineering Manager                      5
Business Data Analyst                         5
Applied Data Scientist                        5
Head of Data                                  5
Head of Data Science                          4
Applied Machine Learning Scientist            4
Analytics Engineer                            4
Data Analytics Engineer                       4
Machine Learning Infrastructure Engineer      3
Lead Data Analyst                             3
Data Science Engineer                         3
Computer Vision Software Engineer             3
Lead Data Scientist                           3
Principal Data Engineer                       3
Machine Learning Developer                    3
Principal Data Analyst                        2
ETL Developer                                 2
Financial Data Analyst                        2
Cloud Data Engineer                           2
Product Data Analyst                          2
Director of Data Engineering                  2
Staff Data Scientist                          1
Head of Machine Learning                      1
Finance Data Analyst                          1
Marketing Data Analyst                        1
Data Analytics Lead                           1
Big Data Architect                            1
Lead Machine Learning Engineer                1
Data Specialist                               1
3D Computer Vision Researcher                 1
Machine Learning Manager                      1
NLP Engineer                                  1
Name: job_title, dtype: int64

In [21]:
#Convertimos todas las columnas categóricas a números

In [22]:
salaries_X.job_title = salaries_X.job_title.apply(title)

In [23]:
salaries_X.groupby('job_title').salary_in_usd.mean().sort_values(ascending = False)

job_title
Data Scientist      122094.610256
Data Engineer       111003.900000
Machine Learning    110536.816667
Data Analyst        100160.990476
Name: salary_in_usd, dtype: float64

In [24]:
#Primero los trabajos

In [25]:
trabajo = {'Data Scientist': 1, 'Data Engineer': 2, 'Machine Learning': 3, 'Data Analyst':4}  
salaries_X.job_title=salaries_X.job_title.apply(lambda x: trabajo[x])

In [26]:
#salaries_X.job_title=LabelEncoder().fit_transform(salaries_X.job_title)

In [27]:
#Experience_level

In [28]:
salaries_X.groupby('experience_level').salary_in_usd.mean().sort_values(ascending = False)

experience_level
EX    196078.850000
SE    136341.794239
MI     90384.610465
EN     59989.569231
Name: salary_in_usd, dtype: float64

In [29]:
salaries_X.experience_level.unique()

array(['SE', 'MI', 'EN', 'EX'], dtype=object)

In [30]:
experiencia = {'EX' : 4, 'SE' : 3, 'MI' : 2, 'EN' : 1}
salaries_X.experience_level=salaries_X.experience_level.apply(lambda x: experiencia[x])

In [31]:
#salaries_X.experience_level=LabelEncoder().fit_transform(salaries_X.experience_level)

In [32]:
#Company_size

In [33]:
salaries_X.groupby('company_size').salary_in_usd.mean().sort_values(ascending = False)

company_size
L    121031.375758
M    115805.494505
S     79242.435484
Name: salary_in_usd, dtype: float64

In [34]:
salaries_X.company_size.unique()

array(['M', 'L', 'S'], dtype=object)

In [35]:
size = {'M' : 3, 'L' : 2, 'S' : 1}
salaries_X.company_size=salaries_X.company_size.apply(lambda x: size[x])

In [36]:
#Employment_type

In [37]:
salaries_X.employment_type=LabelEncoder().fit_transform(salaries_X.employment_type)

In [38]:
#Company_location

In [39]:
counts = pd.DataFrame(salaries_X.company_location.value_counts())

In [40]:
salaries_X.company_location=LabelEncoder().fit_transform(salaries_X.company_location)

In [41]:
#company_location

In [42]:
companies_loc = pd.DataFrame(salaries_X.groupby('company_location').salary_in_usd.mean())

In [43]:
companies_loc.reset_index(drop = False, inplace = True)

In [44]:
companies_loc.fillna(companies_loc.salary_in_usd.mean(), inplace = True)

In [45]:
#salaries_X['average_salary_location'] = None

In [46]:
'''for e in range(len(salaries_X.company_location)):
    if salaries_X.company_location[e]:
        for t in range(len(companies_loc)):
            if companies_loc.company_location[t] == salaries_X.company_location[e]:
                salaries_X.average_salary_location[e] = companies_loc.salary_in_usd[t]'''

'for e in range(len(salaries_X.company_location)):\n    if salaries_X.company_location[e]:\n        for t in range(len(companies_loc)):\n            if companies_loc.company_location[t] == salaries_X.company_location[e]:\n                salaries_X.average_salary_location[e] = companies_loc.salary_in_usd[t]'

In [47]:
#salaries_X.drop('salary_in_usd', axis = 1, inplace = True,)

In [48]:
#salaries_X.average_salary_location.info()

In [49]:
#salaries_X.average_salary_location.fillna(salaries_X.average_salary_location.mean(), inplace = True)

In [50]:
#salaries_X.average_salary_location

In [51]:
#paises = salaries_X.average_salary_location.value_counts().sort_values(ascending = False)

In [52]:
#paises = pd.DataFrame(paises)

In [53]:
#paises.reset_index(drop = False, inplace = True)

In [54]:
#paises.rename(columns = {'index' : 'salario'}, inplace = True)

In [55]:
salaries_X

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
0,2022,3,2,2,140250.0,100,48,3
1,2022,3,2,2,135000.0,100,48,3
2,2021,2,2,4,100000.0,100,48,3
3,2021,2,0,3,270000.0,100,48,2
4,2021,2,2,2,26005.0,0,48,2
...,...,...,...,...,...,...,...,...
602,2022,3,2,4,NaN,100,48,3
603,2022,3,2,1,NaN,100,48,3
604,2022,3,2,1,NaN,100,48,3
605,2022,1,2,4,NaN,0,6,3
606,2022,3,2,4,NaN,0,48,3

In [56]:
def limpiar_sal(col):
    if col < 31243:
        return 1
    elif col > 31243 and col < 71445:
        return 2
    elif col > 71445:
        return 3

In [57]:
salaries_X.company_location.value_counts()

48    355
18     47
6      30
12     28
25     24
17     15
16     14
19     11
29      6
41      4
2       4
40      4
37      4
39      3
13      3
3       3
5       3
0       3
46      3
31      3
34      3
7       2
28      2
11      2
43      2
4       2
45      2
36      2
9       2
33      1
20      1
24      1
42      1
44      1
10      1
26      1
21      1
38      1
22      1
27      1
14      1
15      1
47      1
8       1
30      1
49      1
23      1
1       1
32      1
35      1
Name: company_location, dtype: int64

In [58]:
#salaries_X.salary_in_usd = salaries_X.salary_in_usd.apply(limpiar_sal)

In [59]:
#salaries_X.rename(columns = {'salary_in_usd' : 'company_location1'}, inplace = True)

In [60]:
salaries_X

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
0,2022,3,2,2,140250.0,100,48,3
1,2022,3,2,2,135000.0,100,48,3
2,2021,2,2,4,100000.0,100,48,3
3,2021,2,0,3,270000.0,100,48,2
4,2021,2,2,2,26005.0,0,48,2
...,...,...,...,...,...,...,...,...
602,2022,3,2,4,NaN,100,48,3
603,2022,3,2,1,NaN,100,48,3
604,2022,3,2,1,NaN,100,48,3
605,2022,1,2,4,NaN,0,6,3
606,2022,3,2,4,NaN,0,48,3

In [61]:
#salaries_X.drop('company_location', axis = 1, inplace = True)

In [62]:
#salaries_X.rename(columns = {'average_salary_location' : 'company_location'}, inplace = True)

In [63]:
cols = ['work_year', 'experience_level', 'employment_type', 'job_title',
       'remote_ratio', 'company_size', 'company_location']

In [64]:
#normalizamos el dataframe

In [81]:
salaries_X.drop('salary_in_usd', axis = 1, inplace = True)

In [82]:
scaler=StandardScaler()

In [83]:
salaries_X[cols] = scaler.fit_transform(salaries_X[cols])

In [68]:
#separamos testeo

In [84]:
X = salaries_X[0:500]

In [85]:
testeo = salaries_X[500:]

In [86]:
testeo.reset_index(drop = True, inplace = True)

In [87]:
testeo

,work_year,experience_level,employment_type,job_title,remote_ratio,company_location,company_size
0,-2.032024,0.761946,0.027854,0.726867,-1.743615,-0.429997,-1.954080
1,-2.032024,-0.512162,0.027854,1.597100,0.714862,0.756121,-0.558637
2,-2.032024,-0.512162,0.027854,1.597100,0.714862,0.756121,-0.558637
3,-2.032024,-0.512162,0.027854,0.726867,-1.743615,-1.678542,0.836806
4,-2.032024,-0.512162,0.027854,1.597100,0.714862,-0.679706,-0.558637
...,...,...,...,...,...,...,...
102,0.859977,0.761946,0.027854,1.597100,0.714862,0.756121,0.836806
103,0.859977,0.761946,0.027854,-1.013599,0.714862,0.756121,0.836806
104,0.859977,0.761946,0.027854,-1.013599,0.714862,0.756121,0.836806
105,0.859977,-1.786271,0.027854,1.597100,-1.743615,-1.865824,0.836806
106,0.859977,0.761946,0.027854,1.597100,-1.743615,0.756121,0.836806

**PREDICCIONES**

In [105]:
#DIVISIONES 

X_train, X_test, y_train, y_test = tts(X, y, train_size=0.8, test_size=0.2, random_state=22)

X_train.shape, X_test.shape, y_train.shape, y_test.shape

((400, 7), (100, 7), (400,), (100,))

,work_year,experience_level,employment_type,job_title,remote_ratio,company_location,company_size
94,0.859977,0.761946,0.027854,-0.143366,-1.743615,0.756121,0.836806
350,-2.032024,-1.786271,0.027854,1.597100,0.714862,0.006993,-1.954080
288,-0.586023,2.036055,-8.425971,-1.013599,0.714862,0.756121,-1.954080
420,-0.586023,2.036055,0.027854,-1.013599,-0.514377,-1.491261,0.836806
163,-2.032024,-1.786271,0.027854,-1.013599,-0.514377,-0.679706,0.836806
...,...,...,...,...,...,...,...
356,-0.586023,-0.512162,0.027854,-1.013599,-0.514377,-1.179124,0.836806
448,-2.032024,-0.512162,0.027854,-0.143366,-0.514377,-1.116697,-0.558637
300,0.859977,0.761946,0.027854,-0.143366,-1.743615,-1.116697,0.836806
132,-0.586023,-0.512162,0.027854,-1.013599,-0.514377,0.756121,-0.558637
373,-0.586023,-1.786271,0.027854,1.597100,0.714862,-0.305143,-0.558637

-- PREDICCIONES--

In [125]:
def predecir(x_train, x_test, y_train, y_test):
    #inicializamos todos los modelos que vamos a probar
    svr=SVR()
    rfr=RFR()
    etr=ETR()
    gbr=GBR()
    xgbr=XGBR()
    ctr=CTR()
    linreg=LinReg()
    lasso=Lasso()
    ridge=Ridge()
    elastic=ElasticNet()
    #los entrenamos
    svr.fit(x_train, y_train)
    rfr.fit(x_train, y_train)
    etr.fit(x_train, y_train)
    gbr.fit(x_train, y_train)
    xgbr.fit(x_train, y_train)
    ctr.fit(x_train, y_train, verbose=0)
    linreg.fit(x_train, y_train)
    lasso.fit(x_train, y_train)
    ridge.fit(x_train, y_train)
    elastic.fit(x_train, y_train)
    #predecimos
    y_pred1 = svr.predict(x_test)
    y_pred2 = rfr.predict(x_test)
    y_pred3 = etr.predict(x_test)
    y_pred4 = gbr.predict(x_test)
    y_pred5 = xgbr.predict(x_test)
    y_pred6 = ctr.predict(x_test)
    y_pred7 = linreg.predict(x_test)
    y_pred8 = lasso.predict(x_test)
    y_pred9 = ridge.predict(x_test)
    y_pred10 = elastic.predict(x_test)
    #calculamos error cuadrático medio (mse)
    mse1 = mse(y_test, y_pred1, squared=False)
    mse2 = mse(y_test, y_pred2, squared=False)
    mse3 = mse(y_test, y_pred3, squared=False)
    mse4 = mse(y_test, y_pred4, squared=False)
    mse5 = mse(y_test, y_pred5, squared=False)
    mse6 = mse(y_test, y_pred6, squared=False)
    mse7 = mse(y_test, y_pred7, squared=False)
    mse8 = mse(y_test, y_pred8, squared=False)
    mse9 = mse(y_test, y_pred9, squared=False)
    mse10 = mse(y_test, y_pred10, squared=False)
    #creamos una lista con todos los mse
    temp = [mse1, mse2, mse3, mse4, mse5, mse6, mse7, mse8, mse9, mse10]
    #pedimos a la función que nos devuelva el valor más bajo de mse   
    minimo = min(temp)
    #le ponemos un mensajito para que quede más mono
    if minimo == mse1:
        return f'El mejor modelo es SVR con un mse de {mse1}'
    elif minimo == mse2:
        return f'El mejor modelo es RFR con un mse de {mse2}'
    elif minimo == mse3:
        return f'El mejor modelo es ETR con un mse de {mse3}'
    elif minimo == mse4:
        return f'El mejor modelo es GBR con un mse de {mse4}'
    elif minimo == mse5:
        return f'El mejor modelo es XGBR con un mse de {mse5}'
    elif minimo == mse6:
        return f'El mejor modelo es CTR con un mse de {mse6}'
    elif minimo == mse7:
        return f'El mejor modelo es LINREG con un mse de {mse7}'
    elif minimo == mse8:
        return f'El mejor modelo es LASSO con un mse de {mse8}'
    elif minimo == mse9:
        return f'El mejor modelo es RIDGE con un mse de {mse9}'
    elif minimo == mse10:
        return f'El mejor modelo es ELASTIC con un mse de {mse10}'

In [127]:
predecir(X_train, X_test, y_train, y_test)

'El mejor modelo es RFR con un mse de 41021.14158908165'

In [115]:
X_test.shape

(100, 7)

In [89]:
from sklearn.ensemble import RandomForestRegressor as RFR

In [90]:
rfr=RFR()

In [91]:
rfr.fit(X_train, y_train)

RandomForestRegressor()

In [92]:
y_pred = rfr.predict(X_test)

In [93]:
from sklearn.metrics import mean_squared_error as mse

In [94]:
mse(y_test, y_pred, squared = False)

41702.07584176582

In [ ]:
y_pred

In [ ]:
prueba = pd.DataFrame(y_pred, columns = ['salary_in_usd'])

In [ ]:
prueba.to_csv('../data/prueba5.csv', index_label = 'ID')